<h2>Data Cleaning</h2>

In [3]:
pip install pandas

Requirement already satisfied: pandas in /home/sigiey/anaconda3/lib/python3.9/site-packages (1.4.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /home/sigiey/anaconda3/lib/python3.9/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /home/sigiey/anaconda3/lib/python3.9/site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.18.5 in /home/sigiey/anaconda3/lib/python3.9/site-packages (from pandas) (1.21.5)
Requirement already satisfied: six>=1.5 in /home/sigiey/anaconda3/lib/python3.9/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd

In [6]:
pd.read_csv(r"/home/sigiey/Documents/Data Science/ASSIGNMENTS/messy_data.csv"
           )

,TrnsnID,Data,CusmrID,ProdtID,ProdtName,Qutity,Prize,TtlSales,PaymentType,CusterAge
0,7402,03/17/2026,991,1045,Boo E,9,167.72,2935.06,NaN,87
1,5835,26-01-2035,741,1040,Book J,18,193.27,4386.52,debit card,69
2,2123,05/26/2035,933,1062,Bok N,5,126.39,1948.46,Cash,15
3,8789,28-02-2036,641,1060,Book I,6,66.98,1757.26,Cash,22
4,305,19-04-2023,123,1058,Book B,15,33.63,2578.19,Cash,-1
...,...,...,...,...,...,...,...,...,...,...
10095,5735,04/03/2027,52,1066,Book G,1,191.41,2788.25,Credit Card,91
10096,5192,08/16/2025,334,1093,Bok N,-2,186.16,1187.53,paypal,50
10097,5391,06/18/2026,657,1047,Bookk H,5,84.38,2119.76,debit card,63
10098,861,04/08/2034,579,1014,Bok N,19,137.58,1708.87,Debit,-7
10099,7271,26-04-2029,153,1052,Book T,10,159.98,2743.67,debit card,77

In [7]:
data = pd.read_csv(r"/home/sigiey/Documents/Data Science/ASSIGNMENTS/messy_data.csv"
           )

In [9]:
data.head()

,TrnsnID,Data,CusmrID,ProdtID,ProdtName,Qutity,Prize,TtlSales,PaymentType,CusterAge
0,7402,03/17/2026,991,1045,Boo E,9,167.72,2935.06,NaN,87
1,5835,26-01-2035,741,1040,Book J,18,193.27,4386.52,debit card,69
2,2123,05/26/2035,933,1062,Bok N,5,126.39,1948.46,Cash,15
3,8789,28-02-2036,641,1060,Book I,6,66.98,1757.26,Cash,22
4,305,19-04-2023,123,1058,Book B,15,33.63,2578.19,Cash,-1

In [10]:
data.tail()

,TrnsnID,Data,CusmrID,ProdtID,ProdtName,Qutity,Prize,TtlSales,PaymentType,CusterAge
10095,5735,04/03/2027,52,1066,Book G,1,191.41,2788.25,Credit Card,91
10096,5192,08/16/2025,334,1093,Bok N,-2,186.16,1187.53,paypal,50
10097,5391,06/18/2026,657,1047,Bookk H,5,84.38,2119.76,debit card,63
10098,861,04/08/2034,579,1014,Bok N,19,137.58,1708.87,Debit,-7
10099,7271,26-04-2029,153,1052,Book T,10,159.98,2743.67,debit card,77

In [12]:
data.columns

Index(['TrnsnID', 'Data', 'CusmrID', 'ProdtID', 'ProdtName', 'Qutity', 'Prize',
       'TtlSales', 'PaymentType', 'CusterAge'],
      dtype='object')

In [13]:
data.rows

AttributeError: 'DataFrame' object has no attribute 'rows'

In [32]:
data.shape

(10000, 10)

In [33]:
data.duplicated().sum()

0

In [17]:
duplicate_rows = data.duplicated()

In [18]:
print(data[duplicate_rows])

      TrnsnID        Data  CusmrID  ProdtID ProdtName  Qutity   Prize  \
919       800  02-12-2023      480     1060    Book I       9   77.26
980      1057  04-10-2034      138     1086    Book T       5   94.21
1062     2305  12/19/2025      252     1015    Book G      17  100.39
1119     2593  18-04-2029      885     1094       NaN       4   62.35
1136     2928  12/07/2033       43     1074    Book J      11  172.68
...       ...         ...      ...      ...       ...     ...     ...
9587     8285  01/05/2036      220     1047    Book G      16  185.09
9598     9921  08/24/2026       84     1034    Book I       5   41.14
9785     5360  10/05/2028       35     1061    Book S      -4   90.41
9825      953  19-02-2026      587     1051       NaN      11  119.82
9951     8128  24-01-2035      458     1033    Book G      -2   88.56

      TtlSales  PaymentType  CusterAge
919    2032.76          NaN         53
980    4352.25       Credit         61
1062   3003.74        Debit         58
1119   4545.08   debit card         -4
1136   1466.96        Debit         17
...        ...          ...        ...
9587    179.46        Debit         97
9598   3370.37       Credit         94
9785   2773.98  Credit Card         49
9825   3009.55       Credit        -10
9951   2157.74          NaN         58

[100 rows x 10 columns]

In [19]:
data_cleaned = data.drop_duplicates()

In [20]:
print(data_cleaned)

       TrnsnID        Data  CusmrID  ProdtID ProdtName  Qutity   Prize  \
0         7402  03/17/2026      991     1045     Boo E       9  167.72
1         5835  26-01-2035      741     1040    Book J      18  193.27
2         2123  05/26/2035      933     1062     Bok N       5  126.39
3         8789  28-02-2036      641     1060    Book I       6   66.98
4          305  19-04-2023      123     1058    Book B      15   33.63
...        ...         ...      ...      ...       ...     ...     ...
10095     5735  04/03/2027       52     1066    Book G       1  191.41
10096     5192  08/16/2025      334     1093     Bok N      -2  186.16
10097     5391  06/18/2026      657     1047   Bookk H       5   84.38
10098      861  04/08/2034      579     1014     Bok N      19  137.58
10099     7271  26-04-2029      153     1052    Book T      10  159.98

       TtlSales  PaymentType  CusterAge
0       2935.06          NaN         87
1       4386.52   debit card         69
2       1948.46         Cash         15
3       1757.26         Cash         22
4       2578.19         Cash         -1
...         ...          ...        ...
10095   2788.25  Credit Card         91
10096   1187.53       paypal         50
10097   2119.76   debit card         63
10098   1708.87        Debit         -7
10099   2743.67   debit card         77

[10000 rows x 10 columns]

In [21]:
print(data[duplicate_rows])

      TrnsnID        Data  CusmrID  ProdtID ProdtName  Qutity   Prize  \
919       800  02-12-2023      480     1060    Book I       9   77.26
980      1057  04-10-2034      138     1086    Book T       5   94.21
1062     2305  12/19/2025      252     1015    Book G      17  100.39
1119     2593  18-04-2029      885     1094       NaN       4   62.35
1136     2928  12/07/2033       43     1074    Book J      11  172.68
...       ...         ...      ...      ...       ...     ...     ...
9587     8285  01/05/2036      220     1047    Book G      16  185.09
9598     9921  08/24/2026       84     1034    Book I       5   41.14
9785     5360  10/05/2028       35     1061    Book S      -4   90.41
9825      953  19-02-2026      587     1051       NaN      11  119.82
9951     8128  24-01-2035      458     1033    Book G      -2   88.56

      TtlSales  PaymentType  CusterAge
919    2032.76          NaN         53
980    4352.25       Credit         61
1062   3003.74        Debit         58
1119   4545.08   debit card         -4
1136   1466.96        Debit         17
...        ...          ...        ...
9587    179.46        Debit         97
9598   3370.37       Credit         94
9785   2773.98  Credit Card         49
9825   3009.55       Credit        -10
9951   2157.74          NaN         58

[100 rows x 10 columns]

In [22]:
data.duplicated().sum()

100

In [23]:
data_cleaned = data_cleaned.reset_index(drop=True)

In [24]:
print(data_cleaned)

      TrnsnID        Data  CusmrID  ProdtID ProdtName  Qutity   Prize  \
0        7402  03/17/2026      991     1045     Boo E       9  167.72
1        5835  26-01-2035      741     1040    Book J      18  193.27
2        2123  05/26/2035      933     1062     Bok N       5  126.39
3        8789  28-02-2036      641     1060    Book I       6   66.98
4         305  19-04-2023      123     1058    Book B      15   33.63
...       ...         ...      ...      ...       ...     ...     ...
9995     5735  04/03/2027       52     1066    Book G       1  191.41
9996     5192  08/16/2025      334     1093     Bok N      -2  186.16
9997     5391  06/18/2026      657     1047   Bookk H       5   84.38
9998      861  04/08/2034      579     1014     Bok N      19  137.58
9999     7271  26-04-2029      153     1052    Book T      10  159.98

      TtlSales  PaymentType  CusterAge
0      2935.06          NaN         87
1      4386.52   debit card         69
2      1948.46         Cash         15
3      1757.26         Cash         22
4      2578.19         Cash         -1
...        ...          ...        ...
9995   2788.25  Credit Card         91
9996   1187.53       paypal         50
9997   2119.76   debit card         63
9998   1708.87        Debit         -7
9999   2743.67   debit card         77

[10000 rows x 10 columns]

In [25]:
data.drop_duplicates(inplace=True)

In [26]:
data.duplicated().sum()

0

In [27]:
print(data_cleaned)

      TrnsnID        Data  CusmrID  ProdtID ProdtName  Qutity   Prize  \
0        7402  03/17/2026      991     1045     Boo E       9  167.72
1        5835  26-01-2035      741     1040    Book J      18  193.27
2        2123  05/26/2035      933     1062     Bok N       5  126.39
3        8789  28-02-2036      641     1060    Book I       6   66.98
4         305  19-04-2023      123     1058    Book B      15   33.63
...       ...         ...      ...      ...       ...     ...     ...
9995     5735  04/03/2027       52     1066    Book G       1  191.41
9996     5192  08/16/2025      334     1093     Bok N      -2  186.16
9997     5391  06/18/2026      657     1047   Bookk H       5   84.38
9998      861  04/08/2034      579     1014     Bok N      19  137.58
9999     7271  26-04-2029      153     1052    Book T      10  159.98

      TtlSales  PaymentType  CusterAge
0      2935.06          NaN         87
1      4386.52   debit card         69
2      1948.46         Cash         15
3      1757.26         Cash         22
4      2578.19         Cash         -1
...        ...          ...        ...
9995   2788.25  Credit Card         91
9996   1187.53       paypal         50
9997   2119.76   debit card         63
9998   1708.87        Debit         -7
9999   2743.67   debit card         77

[10000 rows x 10 columns]

In [28]:
missing_values = data.isnull().sum()

In [30]:
print(missing_values)

TrnsnID           0
Data              0
CusmrID           0
ProdtID           0
ProdtName       994
Qutity            0
Prize             0
TtlSales          0
PaymentType    1439
CusterAge         0
dtype: int64

In [31]:
data.shape

(10000, 10)

In [35]:
data['PaymentType'].fillna('Unknown', inplace=True)

In [36]:
print(missing_values)

TrnsnID           0
Data              0
CusmrID           0
ProdtID           0
ProdtName       994
Qutity            0
Prize             0
TtlSales          0
PaymentType    1439
CusterAge         0
dtype: int64

In [37]:
print(data['PaymentType'].unique())

['Unknown' 'debit card' 'Cash' 'Debit' 'Credit' 'Credit Card' 'paypal']

In [38]:
print(data.isnull().sum())

TrnsnID          0
Data             0
CusmrID          0
ProdtID          0
ProdtName      994
Qutity           0
Prize            0
TtlSales         0
PaymentType      0
CusterAge        0
dtype: int64

In [41]:
data['ProdtName'].fillna('Unknown', inplace=True)

In [42]:
print(data.isnull().sum())

TrnsnID        0
Data           0
CusmrID        0
ProdtID        0
ProdtName      0
Qutity         0
Prize          0
TtlSales       0
PaymentType    0
CusterAge      0
dtype: int64

In [50]:
data['Data'] = pd.to_datetime(data['Data'], format='%d-%m-%Y', errors='coerce')

In [51]:
pd.to_datetime(data['Data'], format='%d-%m-%Y')

0              NaT
1       2035-01-26
2              NaT
3       2036-02-28
4       2023-04-19
           ...
10095          NaT
10096          NaT
10097          NaT
10098          NaT
10099   2029-04-26
Name: Data, Length: 10000, dtype: datetime64[ns]

In [52]:
replacement_date = pd.to_datetime('1900-01-01')

In [53]:
data['Data'].fillna(replacement_date, inplace=True)

In [55]:
pd.to_datetime(data['Data'], format='%d-%m-%Y')

0       1900-01-01
1       2035-01-26
2       1900-01-01
3       2036-02-28
4       2023-04-19
           ...
10095   1900-01-01
10096   1900-01-01
10097   1900-01-01
10098   1900-01-01
10099   2029-04-26
Name: Data, Length: 10000, dtype: datetime64[ns]

In [56]:
# Define the mapping dictionary
payment_type_mapping = {
    'debit card': 'Debit Card',
    'Credit Card': 'Credit Card',
    'Cash': 'Cash',
    'Debit': 'Debit Card', 
    'Credit': 'Credit Card', 
    'paypal': 'Paypal'
}

In [57]:
data['PaymentType'] = data['PaymentType'].str.lower().map(payment_type_mapping)

In [58]:
data.columns

Index(['TrnsnID', 'Data', 'CusmrID', 'ProdtID', 'ProdtName', 'Qutity', 'Prize',
       'TtlSales', 'PaymentType', 'CusterAge'],
      dtype='object')

In [59]:
columns_to_check = ['Qutity', 'Prize', 'TtlSales', 'CusterAge']

In [60]:
print(data[(data[columns_to_check] < 0).any(axis=1)])

       TrnsnID       Data  CusmrID  ProdtID ProdtName  Qutity   Prize  \
4          305 2023-04-19      123     1058    Book B      15   33.63
6         2996 1900-01-01      571     1086    Book D      15  176.27
26        4302 2029-10-12      566     1022     Bok N      -4  111.77
30        4443 1900-01-01      294     1088    Book P       6  137.01
32        4534 1900-01-01      963     1052    Book L       3  152.39
...        ...        ...      ...      ...       ...     ...     ...
10088      770 2036-05-30      835     1072    Book R      -5   83.84
10093      467 1900-01-01      564     1095   Unknown      -3   50.77
10094     6266 1900-01-01      804     1051     Boo E      -2  190.93
10096     5192 1900-01-01      334     1093     Bok N      -2  186.16
10098      861 1900-01-01      579     1014     Bok N      19  137.58

       TtlSales PaymentType  CusterAge
4       2578.19         NaN         -1
6       4822.26         NaN         -4
26      3955.85         NaN         57
30      2783.85         NaN         -8
32       761.66         NaN         -1
...         ...         ...        ...
10088    883.07  Debit Card         69
10093   4433.61         NaN         49
10094   4938.27         NaN         86
10096   1187.53      Paypal         50
10098   1708.87         NaN         -7

[2726 rows x 10 columns]

In [63]:
data[['Qutity', 'Prize', 'CusterAge']] = data[['Qutity', 'Prize', 'CusterAge']].abs()

In [64]:
data['PaymentType'].fillna('Unknown', inplace=True)

In [65]:
print(data[(data[columns_to_check] < 0).any(axis=1)])

Empty DataFrame
Columns: [TrnsnID, Data, CusmrID, ProdtID, ProdtName, Qutity, Prize, TtlSales, PaymentType, CusterAge]
Index: []

In [68]:
print(data[['Qutity', 'Prize', 'CusterAge']])

       Qutity   Prize  CusterAge
0           9  167.72         87
1          18  193.27         69
2           5  126.39         15
3           6   66.98         22
4          15   33.63          1
...       ...     ...        ...
10095       1  191.41         91
10096       2  186.16         50
10097       5   84.38         63
10098      19  137.58          7
10099      10  159.98         77

[10000 rows x 3 columns]

In [69]:
data.columns

Index(['TrnsnID', 'Data', 'CusmrID', 'ProdtID', 'ProdtName', 'Qutity', 'Prize',
       'TtlSales', 'PaymentType', 'CusterAge'],
      dtype='object')

In [70]:

numerical_columns = ['TrnsnID', 'CusmrID', 'ProdtID', 'Qutity', 'Prize', 'TtlSales', 'CusterAge']
for col in numerical_columns:
    mean = data[col].mean()
    std_dev = data[col].std()
    outlier_threshold = 3  
    outliers = data[(data[col] < mean - outlier_threshold * std_dev) | (data[col] > mean + outlier_threshold * std_dev)]
    print(f"Outliers in {col}:")
    print(outliers)


typos_correction = {
    "Bookk": "Book",
    "Boo E": "Book E",
  
}
data['ProdtName'] = data['ProdtName'].replace(typos_correction)

Outliers in TrnsnID:
Empty DataFrame
Columns: [TrnsnID, Data, CusmrID, ProdtID, ProdtName, Qutity, Prize, TtlSales, PaymentType, CusterAge]
Index: []
Outliers in CusmrID:
Empty DataFrame
Columns: [TrnsnID, Data, CusmrID, ProdtID, ProdtName, Qutity, Prize, TtlSales, PaymentType, CusterAge]
Index: []
Outliers in ProdtID:
Empty DataFrame
Columns: [TrnsnID, Data, CusmrID, ProdtID, ProdtName, Qutity, Prize, TtlSales, PaymentType, CusterAge]
Index: []
Outliers in Qutity:
Empty DataFrame
Columns: [TrnsnID, Data, CusmrID, ProdtID, ProdtName, Qutity, Prize, TtlSales, PaymentType, CusterAge]
Index: []
Outliers in Prize:
Empty DataFrame
Columns: [TrnsnID, Data, CusmrID, ProdtID, ProdtName, Qutity, Prize, TtlSales, PaymentType, CusterAge]
Index: []
Outliers in TtlSales:
Empty DataFrame
Columns: [TrnsnID, Data, CusmrID, ProdtID, ProdtName, Qutity, Prize, TtlSales, PaymentType, CusterAge]
Index: []
Outliers in CusterAge:
Empty DataFrame
Columns: [TrnsnID, Data, CusmrID, ProdtID, ProdtName, Qutity, Prize, TtlSales, PaymentType, CusterAge]
Index: []

In [71]:
print(data.dtypes)

TrnsnID                 int64
Data           datetime64[ns]
CusmrID                 int64
ProdtID                 int64
ProdtName              object
Qutity                  int64
Prize                 float64
TtlSales              float64
PaymentType            object
CusterAge               int64
dtype: object

In [72]:
data['TrnsnID'] = data['TrnsnID'].astype(int)
data['Data'] = pd.to_datetime(data['Data'])
data['CusmrID'] = data['CusmrID'].astype(int)
data['ProdtID'] = data['ProdtID'].astype(int)
data['ProdtName'] = data['ProdtName'].astype(str)
data['Qutity'] = data['Qutity'].astype(int)
data['Prize'] = data['Prize'].astype(float)
data['TtlSales'] = data['TtlSales'].astype(float)
data['PaymentType'] = data['PaymentType'].astype(str)
data['CusterAge'] = data['CusterAge'].astype(int)

In [73]:
print(data.dtypes)

TrnsnID                 int64
Data           datetime64[ns]
CusmrID                 int64
ProdtID                 int64
ProdtName              object
Qutity                  int64
Prize                 float64
TtlSales              float64
PaymentType            object
CusterAge               int64
dtype: object

In [74]:
data.rename(columns={
    'TrnsnID': 'TransactionID',
    'Data': 'Date',
    'CusmrID': 'CustomerID',
    'ProdtID': 'ProductID',
    'ProdtName': 'ProductName',
    'Qutity': 'Quantity',
    'Prize': 'Price',
    'TtlSales': 'TotalSales',
    'PaymentType': 'PaymentType',
    'CusterAge': 'CustomerAge'
}, inplace=True)

In [75]:
data.columns

Index(['TransactionID', 'Date', 'CustomerID', 'ProductID', 'ProductName',
       'Quantity', 'Price', 'TotalSales', 'PaymentType', 'CustomerAge'],
      dtype='object')